// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//  let time = Math.floor(Math.random()*60)
// if(time <=15 ){ console.log("Перша частина години")}
// else if(time<=30){console.log("Друга частина години")}
// else if(time<=45){console.log("Третя частина години")}
// else {console.log("Четверта частина години")}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину
// (декаду) місяця потрапляє це число (у першу, другу чи третю).
//
// let day = Math.floor(Math.random()*32)
// if(day <=10 ){ console.log("Перша декада")}
// else if(day<=20){console.log("Друга декада")}
// else {console.log("Третя декада")}
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false.
//     Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//   let test = prompt('Введіть true або false')
//    // if (test === 'true'){console.log('Вірно')}else {console.log('Неправильно')}
//    let a = test === 'true'? console.log('Вірно'):console.log('Неправильно')
//
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = prompt('Введіть 1, 0, -3')
// let property = a !== 0? console.log('Вірно'):console.log('Невірно')
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається
// інфа що заплановано на цей день.

// let week = prompt('Введіть порядковий номер дня тижня')
//
// switch (week) {
//  case "1":
//   console.log("Понеділок: лекція №1");
//   break;
//  case "2":
//   console.log("Вівторок: день практика №1");
//   break;
//  case "3":
//   console.log("Середа: лекція №2");
//   break;
//  case "4":
//   console.log("Четвер: день практика №2");
//   break;
//  case "5":
//   console.log("Пятниця: додоткове");
//   break;
//  case "6":
//   console.log("Субота: англійська");
//   break;
//  default:
//   console.log("Неділя: відпочинок");
// }
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let age = prompt('Введіть рік')
// function fits(x) {
//  if (Number.isInteger(x / 4)) {
//   return 'Високосний';
//  }
//  return 'Не високосний';
// }
// console.log(fits(age ));
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//     let JavS = prompt('Яка «офіційна» назва JavaScript?')
//     if(JavS === 'ECMAScript'){console.log('Правильно!')}
//     else {console.log('Не знаєте? ECMAScript!')}