// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
// в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let arr = friends.length
// let number = arr >= 3 ? console.log('Великий масив,в якому  3 і більше елементи') : console.log('Це маленький масив, в якому менше 3-х елементів');


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

//  let a = +prompt('number 1')
//  let b = +prompt('number 2')
//  let c = +prompt('number 3')
//
//
// if((b<a && a<c) || (c<a && a<b)) console.log(a);
// if((a<b && b<c) || (c<b && b<a)) console.log(b);
// if((a<c && c<b) || (b<c && c<a)) console.log(c);

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let res = a+b<4? result = 'Мало':result = 'Багато';
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число:
// позитивним, негативним або нулем
// напишіть це тернарним оператором

// let ac = prompt(' число')
// let abc = ac<0? console.log('Негативне число'): ac>0? console.log('Позитивне число'): console.log('число 0')

