// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor).
// Скласти результат цих чисел в змінній result.
// let result = [];
// for (let i = 0; i < 10; i++) {
//     let arr = result.push(Math.floor(Math.random()*100));
// }
// console.log(result)


// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
//  let book ={
//     name:'Найбагатший чоловік у Вавилоні',
//      numberofpages: 134,
//      genre: 'finanse'
//  }
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let book ={
//     name:'Найбагатший чоловік у Вавилоні',
//     numberofpages: 134,
//     genre: 'finanse',
//     author:'George S. Clason'
// }
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори.
// let book =[{
//     name:'Найбагатший чоловік у Вавилоні',
//     numberofpages: 134,
//     genre: 'finanse',
//     author:'George S. Clason'
// },
//     {
//     name:'Магія ранку',
//     numberofpages: 227,
//     genre: 'motivation',
//     author:'Hal Elrod'
// }]
// // Вивести кожну книгу як окремий об'єкт
// console.log(book[0])
// console.log(book[1])
// 5. Напишіть код, який вираховує площу прямокутника висотою 23см.
// (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
// let height = 23;
// let width = 10;
// let s = height * width;
// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
// let heightC = 10;
// let dC = 4;
// let v = Math.PI*4*10
// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь)
// або оператор зведення в ступінь **).
// let n = 3;
// let m = 4;
// let v = Math.sqrt(Math.pow(n,2)+Math.pow(m,2))


